Repository: sdlpal/sdlpal
Catalog: winrt/SDLPal.Common/Strings/*/Resources.resw
Source language: en
Languages: zh_hans, zh_hant

# AppDescription
source: SDL-based reimplementation of classic Chinese RPG "Xian Jian Qi Xia Zhuan".
zh_hans: 基于 SDL 重制的经典 RPG 游戏《仙剑奇侠传》。
zh_hant: 基於 SDL 重制的經典 RPG 遊戲《仙劍奇俠傳》。

# AspectRatio.Header
source: keep aspect ratio
zh_hans: 保持纵横比
zh_hant: 保持縱橫比

# AspectRatio.OffContent
source: no
zh_hans: 否
zh_hant: 否

# AspectRatio.OnContent
source: yes
zh_hans: 是
zh_hant: 是

# AudioBuffer.Header
source: audio buffer size
zh_hans: 音频缓冲区大小
zh_hant: 音訊緩衝區大小

# AudioBuffer.PlaceholderText
source: choose audio buffer size
zh_hans: 选择音频缓冲区大小
zh_hant: 選擇音訊緩衝區大小

# BGM.Header
source: format of BGM
zh_hans: 背景音乐格式
zh_hant: 背景音樂格式

# BGM.PlaceholderText
source: choose format of BGM
zh_hans: 选择背景音乐格式
zh_hant: 選擇背景音樂格式

# ButtonBrowse.Content
source: browse
zh_hans: 浏览
zh_hant: 瀏覽

# ButtonDefault.Content
source: default
zh_hans: 默认设置
zh_hant: 默認設定

# ButtonFinish.Content
source: finish
zh_hans: 完成设置
zh_hant: 完成設定

# ButtonReset.Content
source: reset
zh_hans: 还原设置
zh_hant: 還原設定

# CD.Header
source: format of CD track
zh_hans: CD 音轨格式
zh_hant: CD 音軌格式

# CD.PlaceholderText
source: choose format of CD track
zh_hans: 选择 CD 音轨格式
zh_hant: 選擇 CD 音軌格式

# Debug.Content
source: debug
zh_hans: 调试信息
zh_hant: 調試信息

# EnableAVI.Header
source: enable AVI animation
zh_hans: 启用 AVI 过场动画
zh_hant: 啟用 AVI 過場動畫

# EnableAVI.OffContent
source: no
zh_hans: 否
zh_hant: 否

# EnableAVI.OnContent
source: yes
zh_hans: 是
zh_hant: 是

# Error.Content
source: error
zh_hans: 严重错误
zh_hant: 嚴重錯誤

source: extracting...
zh_hans: 正在解压缩……
zh_hant: 正在解壓縮……

# Fatal.Content
source: fatal
zh_hans: 致命错误
zh_hant: 致命錯誤

# FontFile.PlaceholderText
source: no customized font file
zh_hans: 无自定义字体文件
zh_hant: 無自訂字體檔案

# GamePath.Header
source: folder of game resource files
zh_hans: 游戏资源文件夹
zh_hant: 遊戲資源資料夾

# GamePath.PlaceholderText
source: no folder selected
zh_hans: 未选择文件夹
zh_hant: 未選擇資料夾

# Information.Content
source: informational
zh_hans: 运行信息
zh_hant: 運行信息

# LogFile.PlaceholderText
source: no logging file
zh_hans: 无日志文件
zh_hant: 無日誌檔案

# LogFileType
source: log files
zh_hans: 日志文件
zh_hant: 日誌檔案

# LogLevel.Header
source: logging level
zh_hans: 日志记录级别
zh_hant: 日誌記錄級別

# LogLevel.PlaceholderText
source: choose logging level
zh_hans: 选择日志记录级别
zh_hant: 選擇日誌記錄級別

# MBButtonCancel
source: cancel
zh_hans: 取消
zh_hant: 取消

# MBButtonOK
source: ok
zh_hans: 确定
zh_hant: 確定

# MBCrashContent
source: The program is abnormally terminated last time. The setting page has been launched for you. Please check if there are any incorrect settings.
zh_hans: 上次程序异常退出，已显示设置页供您检查设置是否正确。
zh_hant: 上次程式異常退出，已顯示設定頁供您檢查設定是否正確。

# MBDownloadCanceled
source: Download aborted by user!
zh_hans: 下载已被用户中止！
zh_hant: 下載已被用戶中止！

# MBDownloadError
source: Download aborted due to error:
zh_hans: 下载已被如下错误中止：
zh_hant: 下載已被如下錯誤中止：

# MBDownloadMessage
source: You're going to be brought to the download page provided by the game's publisher, and the download link will be automatically centered so that anyone who don't understand Chinese can download it without trouble. The downloaded files will be put into the folder you've just chosen. Please note that this download page is not provided by this App's developer, so we can't guarantee the availablity of the donwload link or take responsibility for any consequences.
zh_hans: 您即将进入游戏发行商提供的游戏资源文件下载页，您可从该页面下载免费的正版游戏资源文件并保存于您所选择的文件夹中。 您应知晓，上述资源文件并非由本应用的开发方提供，故我们无法保证下载链接的可用性，也不对您的行为承担任何责任。
zh_hant: 您即將進入由遊戲發行商提供的遊戲資源檔下載頁，您可從該頁面下載免費的正版遊戲資源檔並保存於您所選擇的資料夾中。 您應知曉，上述資源檔並非由本應用的開發方提供，故我們無法保證下載連結的可用性，也不對您的行為承擔任何責任。

# MBDownloadOK
source: Game resource has been successfully downloaded!
zh_hans: 游戏资源下载已成功完成！
zh_hant: 遊戲資源下載已成功完成！

# MBDownloadTitle
source: Download hint
zh_hans: 下载提示
zh_hant: 下載提示

# MBEmptyContent
source: The game resource folder must be specified!
zh_hans: 必须指定游戏资源文件夹！
zh_hant: 必須指定遊戲資源資料夾！

# MBExitContent
source: Settings have been saved and the game will be started on next launch. You can use the main menu option inside the game to return to this page.
zh_hans: 您的设置已保存，下次启动时将直接开始游戏。 在游戏中，您可以通过游戏系统菜单中的返回设置选项回到本设置页面。
zh_hant: 您的設定已保存，下次啟動時將直接開始遊戲。 在遊戲中，您可以通過遊戲系統功能表的返回設定選項回到本設定頁面。

# MBExitTitle
source: Setting finished
zh_hans: 设置已完成
zh_hant: 設定已完成

# MBStartupMessage
source: You need to choose the folder that contains game resource files before you can start the game, because such files are NOT bundled due to copyright restrictions. But fortunately, you have the opportunity to download a licensed copy of the game resource files from Internet for free. To download them, please follow the instructions after you've chosen the folder. Once you've finished the setting process, you will be brought to the game directly at next launch.
zh_hans: 由于受版权限制，游戏资源文件并未包含在本应用当中，您需要首先在设置页面中选择游戏资源所在文件夹后方可进入游戏。 如您尚未拥有游戏资源，也可从Internet上下载免费的正版游戏资源，请在选择文件夹后根据提示进行操作。 一旦您完成设置，在您下一次启动本应用时将直接开始游戏进程。
zh_hant: 由於受智慧產權限制，遊戲資源檔並未包含在本應用當中，您需要首先在設置頁面中選擇遊戲資源所在資料夾後方可進入遊戲。 如您尚未擁有遊戲資源，亦可從Internet上下載免費的正版遊戲資源，請在選擇資料夾後根據提示進行操作。 一旦您完成設置，在您下一次啟動本應用時將直接開始遊戲進程。

# MBStartupTitle
source: Welcome to SDLPal!
zh_hans: 欢迎您使用 SDLPal！
zh_hant: 歡迎您使用 SDLPal！

# MessageFile.PlaceholderText
source: no customized message file
zh_hans: 无自定义语言文件
zh_hant: 無自訂語言檔案

# MusicVolume.Header
source: music volume
zh_hans: 音乐音量
zh_hant: 音樂音量

# OPL.Header
source: type of OPL emulator
zh_hans: OPL 模拟器
zh_hant: OPL 模擬器

# OPL.PlaceholderText
source: choose type of OPL emulator
zh_hans: 选择 OPL 模拟器
zh_hant: 選擇 OPL 模擬器

# OPLSR.Header
source: sample rate of OPL emulator
zh_hans: OPL 模拟器采样率
zh_hant: OPL 模擬器取樣速率

# OPLSR.PlaceholderText
source: choose sample rate of OPL emulator
zh_hans: 选择 OPL 模拟器采样率
zh_hant: 選擇 OPL 模擬器取樣速率

# Publisher
source: SDLPAL development team
zh_hans: SDLPAL 开发组
zh_hant: SDLPAL 開發組

# Quality.Header
source: audio quality
zh_hans: 音频质量
zh_hant: 音訊品質

# Samplerate.Header
source: sample rate of audio output
zh_hans: 音频输出采样率
zh_hant: 音訊輸出取樣速率

# Samplerate.PlaceholderText
source: choose sample rate of audio output
zh_hans: 选择音频输出采样率
zh_hant: 選擇音訊輸出取樣速率

# SoundVolume.Header
source: sound volume
zh_hans: 音效音量
zh_hant: 音效音量

# Stereo.Header
source: stereo
zh_hans: 立体声
zh_hant: 立體聲

# Stereo.OffContent
source: no
zh_hans: 否
zh_hant: 否

# Stereo.OnContent
source: yes
zh_hans: 是
zh_hant: 是

# SurroundOPL.Header
source: use surround OPL
zh_hans: 环绕声 OPL
zh_hant: 環繞聲 OPL

# SurroundOPL.OffContent
source: no
zh_hans: 否
zh_hant: 否

# SurroundOPL.OnContent
source: yes
zh_hans: 是
zh_hant: 是

# Title.Text
source: setting
zh_hans: 设置模式
zh_hant: 設定模式

# TouchOverlay.Header
source: use touch overlay
zh_hans: 启用触屏辅助
zh_hant: 啟用觸屏輔助

# TouchOverlay.OffContent
source: no
zh_hans: 否
zh_hant: 否

# TouchOverlay.OnContent
source: yes
zh_hans: 是
zh_hant: 是

# UseFontFile.Content
source: use customized font file
zh_hans: 自定义字体文件
zh_hant: 自訂字體檔案

# UseLogFile.Content
source: log to file
zh_hans: 记录日志到文件
zh_hant: 記錄日誌到檔案

# UseMessageFile.Content
source: customized message file
zh_hans: 自定义语言文件
zh_hant: 自訂語言檔案

# Verbose.Content
source: verbose
zh_hans: 详细信息
zh_hant: 詳細信息

# Warning.Content
source: warning
zh_hans: 普通警告
zh_hant: 普通警告

# MBButtonNo
source: no
zh_hans: 否
zh_hant: 否

# MBButtonYes
source: yes
zh_hans: 是
zh_hant: 是

# MBDownloadRequiredText
source: The folder you chose doesn't contain necessary game resource files. Do you wish to download a lincensed copy of them from Internet?
zh_hans: 您所选择的目标文件夹不包含游戏资源，是否需要本应用协助您从Internet上下载免费的正版游戏资源？
zh_hant: 您所選擇的目的資料夾不包含遊戲資源，是否需要本應用協助您從Internet上下載免費的正版遊戲資源？

# MBRequired
source: Missing required game resource in folder '{0}'. Please choose the correct folder or download game resource from the offical website!
zh_hans: 在文件夹“{0}”中缺少必需的游戏资源文件，请选择正确的文件夹或从官方网站下载游戏数据文件！
zh_hant: 在資料夾「{0}」中缺少必需的遊戲資源檔，請選擇正確的檔案夾或從官方網站下載遊戲資料檔案！

# ButtonStop
source: stop
zh_hans: 停止
zh_hant: 停止

# MBButtonFromBaiyou
source: baiyou100.com
zh_hans: 百游
zh_hant: 百遊

# MBButtonFromURL
source: customized URL
zh_hans: 自定义 URL
zh_hant: 自訂 URL

# MBDownloadOption
source: please choose the download location
zh_hans: 请点击相应的按钮以选择下载来源
zh_hant: 請點擊相應的按鈕以選擇下載來源

# MBDownloadRequiredTitle
source: missing necessary game resource in folder
zh_hans: 目标文件夹中无游戏资源
zh_hant: 目的資料夾無遊戲資源

# URL.Header
source: URL of the game resource's Zip archive
zh_hans: 游戏资源 Zip 压缩包地址
zh_hant: 遊戲資源 Zip 壓縮包地址

# MBFolderManually
source: Please put game resource files into the folder before you select it.
zh_hans: 请先将游戏资源文件放入后再选取该文件夹！
zh_hant: 請先將遊戲資源檔放入後再選取該資料夾！

# MBDownloadIncomplete
source: The downloaded archive does not contain necessary game resource files!
zh_hans: 已下载的压缩包中未包含全部必备的游戏资源文件！
